class QuranHadithAboutQuran {
  final String quote;
  final String reference;

  QuranHadithAboutQuran({required this.quote, required this.reference});

  factory QuranHadithAboutQuran.fromJson(Map<String, dynamic> json) {
    return QuranHadithAboutQuran(
      quote: json['verse'] as String,
      reference: json['resource'] as String,
    );
  }

  Map<String, dynamic> toJson() {
    return {
      'verse': quote,
      'resource': reference,
    };
  }

  static List<QuranHadithAboutQuran> listOfVersesAndHadhiths = [
    QuranHadithAboutQuran(
      quote:
          "இந்தக் குர்ஆன் ரமளான் மாதத்தில் அருளப்பட்டது. (இது) மனிதர்களுக்கு நேர்வழி காட்டும். நேர்வழியைத் தெளிவாகக் கூறும். (பொய்யை விட்டு உண்மையை) பிரித்துக் காட்டும். உங்களில் அம்மாதத்தை அடைபவர் அதில் நோன்பு நோற்கட்டும்.",
      reference: "(அல்குர்ஆன் 2:185)",
    ),
    QuranHadithAboutQuran(
      quote:
          "இந்தக் குர்ஆன் நேரானதற்கு வழி காட்டுகிறது. “நம்பிக்கை கொண்டு நல்லறங்கள் செய் வோருக்கு பெரிய கூலி உள்ளது” என்று நற்செய்தியும் கூறுகிறது.",
      reference: "(அல்குர்ஆன் 17:9)",
    ),
    QuranHadithAboutQuran(
      quote:
          "(பொய்யையும் உண்மையையும்) பிரித்துக் காட்டும் வழி முறையை அகிலத்தாருக்கு எச்சரிக்கை செய்யக் கூடியதாக தனது அடியார் மீது அருளியவன் பாக்கியமானவன்.",
      reference: "(அல்குர்ஆன் 25:1)",
    ),
    QuranHadithAboutQuran(
      quote:
          "குர்ஆன் ஓதப்படும் போது அதைச் செவிமடுங்கள்! வாய் மூடுங்கள்! நீங்கள் அருள் செய்யப் படுவீர்கள்!",
      reference: "(அல்குர்ஆன் 7:204)",
    ),
    QuranHadithAboutQuran(
      quote:
          "நிச்சயமாக இக்குர்ஆனை நன்கு நினைவு படுத்திக் கொள்ளும் பொருட்டே எளிதாக்கி வைத்திருக்கின்றோம்; எனவே இதிலிருந்து நல்லுணர்வு பெறுவோர் உண்டா?",
      reference: "(அல்குர்ஆன் 54:32)",
    ),
    QuranHadithAboutQuran(
      quote:
          "மேலும் அவர்கள் இந்தக் குர்ஆனை ஆராய்ந்து பார்க்க வேண்டாமா? அல்லது அவர்கள் இருதயங்கள் (இருக்கின்றனவே) அவற்றின் மீது பூட்டுப் போடப்பட்டு விட்டனவா?",
      reference: "(அல்குர்ஆன் 47:24)",
    ),
    QuranHadithAboutQuran(
      quote:
          "நிச்சயமாக இக்குர்ஆனை நன்கு நினைவு படுத்திக் கொள்ளும் பொருட்டே எளிதாக்கி வைத்திருக்கின்றோம்; எனவே இதிலிருந்து நல்லுணர்வு பெறுவோர் உண்டா?",
      reference: "(அல்குர்ஆன் 54:32)",
    ),
    QuranHadithAboutQuran(
      quote:
          "இன்னும், நாம் முஃமின்களுக்கு ரஹ்மத்தாகவும், அருமருந்தாகவும் உள்ளவற்றையே குர்ஆனில் (படிப்படியாக) இறக்கிவைத்தோம் ஆனால் அக்கிரமக் காரர்களுக்கோ இழப்பைத் தவிர வேறெதையும் (இது) அதிகமாக்குவதில்லை.",
      reference: "(அல்குர்ஆன் 17:82)",
    ),
    QuranHadithAboutQuran(
      quote:
          "மனிதர்களே! உங்கள் இறைவனிடமிருந்து உங்களுக்கு நிச்சயமாக ஒரு நல்லுபதேசமும் வந்துள்ளது. (உங்கள்) இதயங்களிலுள்ள நோய்களுக்கு அருமருந்தும் (வந்திருக்கிறது) மேலும் (அது) முஃமின்களுக்கு நேர்வழிகாட்டியாகவும், நல்லருளாகவும் உள்ளது.",
      reference: "(அல்குர்ஆன் 10:57)",
    ),
    QuranHadithAboutQuran(
      quote:
          "(முஹம்மதே!) காகிதத்தில் எழுதப்பட்ட வேதத்தை உமக்கு நாம் அருளியிருந்து அதைத் தம் கைகளால் தொட்டுப் பார்த்தாலும் \"இது வெளிப்படையான சூனியத்தைத் தவிர வேறு இல்லை\" என்று (ஏகஇறைவனை) மறுப்போர் கூறியிருப்பார்கள்.",
      reference: "(திருக்குர்ஆன் 6:7)",
    ),
    QuranHadithAboutQuran(
      quote:
          "இது அகிலத்தாரின் இறைவனிடமிருந்து அருளப்பட்டது. சில சொற்களை இவர் (முஹம்மது) நம்மீது இட்டுக்கட்டியிருந்தால் வலது கையால் இவரைத் தண்டித்திருப்போம். பின்னர் அவரது நாடி நரம்பைத் துண்டித்திருப்போம்.",
      reference: "(திருக்குர்ஆன் 69:43-46)",
    ),
    QuranHadithAboutQuran(
      quote:
          "உயிருடன் உள்ளவரை எச்சரிப்பதற்காகவும், (நம்மை) மறுப்போருக்கு எதிரான கட்டளை உறுதியாவதற்காகவும் (இதை அருளினோம்).",
      reference: "(திருக்குர்ஆன் 6:70)",
    ),
    QuranHadithAboutQuran(
      quote:
          "குர்ஆனை ஓதும் போது விரட்டப்பட்ட ஷைத்தானை விட்டும் அல்லாஹ்விடம் பாதுகாப்புத் தேடிக்கொள்வீராக!",
      reference: "(திருக்குர்ஆன் 16:98)",
    ),
    QuranHadithAboutQuran(
      quote:
          "நிச்சயமாக நாம் தான் (நினைவூட்டும்) இவ்வேதத்தை (உம்மீது) இறக்கி வைத்தோம்; நிச்சயமாக நாமே அதன் பாதுகாவலனாகவும் இருக்கின்றோம்.",
      reference: "(திருக்குர்ஆன் 15:9)",
    ),
    QuranHadithAboutQuran(
      quote:
          "(ஏகஇறைவனை) மறுப்போர் வெறுத்த போதும் நீங்கள் வணக்கத்தை அல்லாஹ்வுக்கே தூய எண்ணத்துடன் உரித்தாக்கி அவனிடமே பிரார்த்தியுங்கள்!",
      reference: "(திருக்குர்ஆன் 40:14)",
    ),
    QuranHadithAboutQuran(
      quote: "மேலும் குர்ஆனைத் தெளிவாகவும் நிறுத்தி நிதானமாகவும் ஓதுவீராக!",
      reference: "(திருக்குர்ஆன் 73:4)",
    ),
    QuranHadithAboutQuran(
      quote:
          "அலிஃப், லாம், ரா. மனிதர்களை அவர்களது இறைவனின் விருப்பப்படி இருள்களிலிருந்து வெளிச்சத்திற்கும், புகழுக்குரிய மிகைத்தவனின் பாதைக்கும் நீர் கொண்டு செல்வதற்காக உமக்கு இவ்வேதத்தை அருளினோம்.",
      reference: "(திருக்குர்ஆன் 14:1)",
    ),
    QuranHadithAboutQuran(
      quote:
          "குர்ஆன் ஓதப்படும் போது அதை செவிமடுங்கள். வாய் மூடுங்கள். நீங்கள் அருள் செய்யப்படுவீர்கள்.",
      reference: "(அல்குர்ஆன் 7:204)",
    ),
    QuranHadithAboutQuran(
      quote:
          "\"அல்லாஹ்வின் வேதத்திலிருந்து ஓர் எழுத்தை ஓதுபவருக்கு ஒரு நன்மை உண்டு! ஒரு நன்மை பத்து நன்மைகளைப் போன்றதாகும். 'அலிஃப், லாம், மீம்' என்பதை ஓர் எழுத்து என்று சொல்ல மாட்டேன். மாறாக, 'அலிஃப்' ஓரெழுத்து, 'லாம்' ஓரெழுத்து, 'மீம்' ஓரெழுத்து என்று தான் கூறுவேன்\". \n- முஹம்மது நபி (ஸல்)",
      reference: "(நூல் : திர்மிதீ-2910)",
    ),
    QuranHadithAboutQuran(
      quote:
          "\"நீங்கள் குர்ஆனை ஓதுங்கள். நிச்சயமாக அது மறுமை நாளில் அதைச் சார்ந்தவருக்குப் பரிந்துரையாக வரும்\". \n- முஹம்மது நபி (ஸல்)",
      reference: "(நூல் : முஸ்லிம்-1470)",
    ),
    QuranHadithAboutQuran(
        quote:
            "\"குர்ஆனை நன்கு மனனம் செய்து தங்கு தடையின்றி சரளமாக ஓதுபவர் இறைவனுக்குக் கட்டுப்பட்ட கண்ணியமிக்க வானவத் தூதர்களுடன் இருக்கின்றார். சிரமம் மேற்கொண்டு தட்டுத் தடுமாறி ஓதுபவருக்கு இரு கூலிகள் இருக்கின்றன\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : முஸ்லிம்-1462)"),
    QuranHadithAboutQuran(
        quote:
            "உங்களில் சிறந்தவர் யார் என்றால், யார் குர்ஆனைத் தானும் கற்று, பிறருக்கும் கற்றுக் கொடுக்கின்றாரோ அவர் தான்.\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : புகாரி-5027)"),
    QuranHadithAboutQuran(
        quote:
            "\"உங்கள் வீடுகளை மண்ணறைகளாக ஆக்கி விடாதீர்கள். எந்த வீட்டில் சூரத்துல் பகரா ஓதப்படுகின்றதோ அந்த வீட்டை விட்டு ஷைத்தான் விரண்டு ஓடுகின்றான்\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : முஸ்லிம்-1430)"),
    QuranHadithAboutQuran(
        quote:
            "\"நீங்கள் படுக்கைக்குச் செல்லும் போது ஆயத்துல் குர்ஸியை ஓதுங்கள். உங்களுடன் ஒரு பாதுகாவலர் (வானவர்) இருந்து கொண்டே இருப்பார். காலை வரை ஷைத்தான் உங்களை நெருங்க மாட்டான்\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : புகாரி 3275)"),
    QuranHadithAboutQuran(
        quote:
            "நபி(ஸல்) அவர்களுக்கு ஒவ்வொரு வருடமும் ரமலானில் ஒரு தடவை குர்ஆனை ஓதிக் காண்பிக்கப்பட்டது. அவர்கள் மரணிக்கும் வருடம் இரண்டு தடவை ஓதிக் காண்பிக்கப்பட்டது.\n- அறிவிப்பவர்: அபூஹுரைரா(ரலி)",
        reference: "(ஆதாரம் : புகாரி)"),
    QuranHadithAboutQuran(
        quote:
            "\"நிச்சயமாக இந்தக் குர்ஆன் பரிந்துரை செய்யக்கூடியதாகும். அது ஏற்கப்படக்கூடியதுமாகும். அதனைப் பின்பற்றினால் அவரை அது சுவனத்தில் சேர்க்கும். அதனை பின்பற்றாமல் விட்டு விட்டால் அல்லது நிராகரித்தால் அவன் நரகின் அடித்தளத்தில் தள்ளப்படுவான்.\" \n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : முஸ்லிம்)"),
    QuranHadithAboutQuran(
        quote:
            "\"குர்ஆனை ஓதி அதன்படி அமல் செய்தவரையும், குர்ஆனையும் நாளை மறுமையில் கொண்டு வரப்படும், குர்ஆனின் இரண்டு அத்தியாயங்கள் அல்பகரா, ஆலஇம்ரான் முன் வந்து அந்த இரண்டையும் ஓதியவருக்காக அல்லாஹ்விடத்தில் வாதாடும்\". \n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம்: முஸ்லிம்)"),
    QuranHadithAboutQuran(
        quote:
            "\"குர்ஆனின் விஷயத்தில் தர்க்கம் புரிவது இறை மறுப்புச் செயலாகும்\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : அபூதாவூத்)"),
    QuranHadithAboutQuran(
        quote:
            "\"இக்குர்ஆனின் ஒரு முனை அல்லாஹ்வின் கையிலும் மறுமுனை உங்கள் கைளிலும் உள்ளது. எனவே இதனை உறுதியாகப் பிடித்துக் கொள்ளுங்கள்; நீங்கள் இம்மையில் வழிதவறமாட்டீர்கள், மறுமையில் அழிவுறவும் மாட்டீர்கள்\". \n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : தப்ரானி)"),
    QuranHadithAboutQuran(
        quote:
            "\"பேச்சுக்களில் மிகச் சிறந்தது அல்லாஹ்வின் வேதமாகும். வழிகாட்டுதல்களில் மிகச்சிறந்தது முஹம்மதுநபி (ஸல்) அவர்களின் வழிகாட்டுதலாகும். மார்க்கத்தில் மிகக்கெட்டது மார்க்கத்தில் புதிதாகப் புகுத்தப்பட்டதாகும். ஒவ்வொரு பித்அத்தும் வழிகேடாகும்\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : முஸ்லிம்)"),
    QuranHadithAboutQuran(
        quote:
            "\"இவ்வேதத்தைக் கொண்டே அல்லாஹ் சில கூட்டத்தாரை உயர்த்துகிறான். மற்றோரு கூட்டத்தினரை இதனைக் கொண்டே தாழ்த்துகிறான். சமுதாய உயர்வு, தாழ்வுக்கு காரணம் குர்ஆனே\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : முஸ்லிம்)"),
    QuranHadithAboutQuran(
        quote:
            "\"எவரது உள்ளத்தில் குர்ஆனின் சிறு பகுதியேனும் மனனம் இல்லையோ அவரது உள்ளம் பாழடைந்த வீட்டைப் போன்றதாகும்\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : திர்மிதி)"),
    QuranHadithAboutQuran(
        quote:
            "\"குர்ஆனை ஓதுவதில் தேர்ச்சி பெற்றவர் கண்ணியமிக்க வானவர்களுடன் இருப்பார். குர்ஆனை ஒதுவது சிரமமாக இருப்பினும் அதைத் திருப்பித்திருப்பி சிரமத்துடன் ஓதுவாரானால் அவருக்கு இரண்டு கூலி இருக்கிறது\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : புகாரி, முஸ்லிம்)"),
    QuranHadithAboutQuran(
        quote:
            "\"மறுமை நாளில் குர்ஆனை ஓதி அதனடிப்படையில் நடந்தவரிடம் குர்ஆனிய தோழரே ஓதுவீராக என்று கூறப்படும். மேலும் உலகத்தில் எவ்வாறு நிறுத்தி நிதானமாக ஓதினீரோ அவ்வாறு ஓதுவீராக! நிச்சயமாக எந்த வசனத்தை கடைசியாக ஓதி முடிப்பாரோ அதுதான் சொர்க்கத்தில் உமது அந்தஸ்தாகும் என்று கூறப்படும்\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : அபூதாவுத், திர்மிதி)"),
    QuranHadithAboutQuran(
        quote:
            "\"நபியவர்கள் மஃரிப் தொழுகையில் அத்தூர் அத்தியாயத்தை ஓதிடக் கேட்டேன். நபியவர்களை விட அழகிய குரலுடைய ஒருவரை அல்லது அழகாக ஓதுபவரை நான் கேட்டதில்லை\"\n- அறிவிப்பவர்: ஜுபைர் பின் முத்இம் (ரலி)",
        reference: "(புகாரி, முஸ்லிம்)"),
    QuranHadithAboutQuran(
        quote:
            "\"குர்ஆனை ஓதி அதன்படி அமல் செய்தவரையும் குர்ஆனையும் நாளை மறுமையில் கொண்டு வரப்படும். குர்ஆனின் இரண்டு சூராக்கள் அல்பகரா, ஆல இம்ரான் முன் வந்து அந்த இரண்டையும் ஓதியவருக்காக அல்லாஹ்விடத்தில் வாதாடும்\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : முஸ்லிம்)"),
    QuranHadithAboutQuran(
        quote:
            "\"உங்கள் வீடுகளை மண்ணறைகளாக ஆக்கி விடாதீர்கள். எந்த வீட்டில் சூரத்துல் பகரா ஓதப்படுகின்றதோ அந்த வீட்டை விட்டு ஷைத்தான் விரண்டு ஓடுகின்றான்\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : முஸ்லிம் 780)"),
    QuranHadithAboutQuran(
        quote:
            "\"நீங்கள் படுக்கைக்குச் செல்லும் போது ஆயத்துல் குர்ஸியை ஓதுங்கள். உங்களுடன் ஒரு பாதுகாவலர் (வானவர்) இருந்து கொண்டே இருப்பார். காலை வரை ஷைத்தான் உங்களை நெருங்க மாட்டான்\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : புஹாரி 3275)"),
    QuranHadithAboutQuran(
        quote:
            "\"ஒவ்வொரு இறைத் தூதரும் அற்புதங்களுடன் அனுப்பப்பட்டனர். எனக்கு வழங்கப்பட்ட அற்புதம் திருக்குர்ஆன்\".\n- முஹம்மது நபி (ஸல்)",
        reference: "(ஆதாரம் : புகாரி 4981,7274)")
  ];
}
